{
  "name": "CryptoCalculatorPro",
  "description": "Master the art of cryptocurrency trading with CryptoCalculatorPro, the all-in-one trade simulator and position management tool designed for serious day traders. Move beyond guesswork and make data-driven decisions by meticulously planning, simulating, and tracking every trade with unparalleled precision.\n\nCryptoCalculatorPro empowers you to understand the full picture of your trades before you risk a single dollar. Our suite of professional-grade features includes:\n\n- **Advanced PnL & Risk Simulation:** Accurately forecast your Profit & Loss (PnL), ROI, and estimated liquidation price. Our engine incorporates exchange-specific fee structures from major platforms like Binance and Bybit for both maker and taker orders, giving you a true reflection of your potential profitability.\n- **Flexible Position Size Calculator:** Whether you trade with margin, a specific amount of crypto, or a total dollar value, our calculator adapts to your strategy, helping you manage risk and leverage effectively across Spot, Cross Margin, and Isolated Margin markets.\n- **Dynamic Trade Logger:** Keep a live log of all your open positions. Seamlessly add new entries to scale into a trade, track your average entry price, and manage complex positions in real-time.\n- **In-Depth Trade Ledger:** Once a trade is closed, save it to your permanent ledger. Add detailed notes and analysis to build a powerful trading journal, learn from your past performance, and refine your strategies over time.\n- **Performance Analytics:** Visualize your progress with a comprehensive account overview, tracking key metrics like total realized PnL and win rate. The cumulative performance chart helps you see your equity curve grow.\n- **Effortless Data Export:** Export your entire trade ledger to a CSV file for advanced analysis in Excel or other financial modeling software.\n\nStop leaving money on the table due to miscalculations. Take control of your trading journey, manage risk like a professional, and build a detailed log of your path to success with CryptoCalculatorPro.",
  "requestFramePermissions": []
}